import React from 'react'
import "./departments.scss"
export const Departments = () => {
    return (
        <div className='department'>
            <p>Кадровая политика – это основа успешной работы Академии. Мы стремимся создать профессиональную и сплочённую команду, где каждый сотрудник чувствует себя ценным и вовлечённым в общее дело.</p>
            <h3>Наши задачи:</h3>
            <ul>
                <li>
                    Развитие международного сотрудничества
                </li>
                <li>Организация конференций и встреч</li>
                <li>Взаимодействие с образовательными и религиозными организациями</li>
            </ul>
            <h4>Заведующий отделом: [Имя Фамилия]</h4>
            <h3>Контакты:</h3>
            <h5>+7 (XXX) XXX-XX-XX</h5>
            <a href="">external@academy.com</a>

        </div>
    )
}
