import './Obraz.scss'

export const Obraz = () => {
    return (
        <div className="container">
          <div className="content">
            <h1 className="textOne">ДОБРО ПОЖАЛОВАТЬ В МИР ЗНАНИЙ!</h1>
            <h2 className="subtitle">Факультет исламского права (фикх)</h2>
            <p className="text">
            Основателями академии стали доктор Ибрагим аль-Фахри и его ученица Амира Халид. Доктор Ибрагим, известный теолог и историк, посвятил свою жизнь изучению ислама и его влияния на культуру и науку. Он мечтал о месте, где бы студенты могли углубленно изучать свою веру и одновременно развивать критическое мышление и научный подход.  
            </p>
            <p className="text1">
            Амира Халид, обладая страстью к образованию и инновациям, сыграла ключевую роль в организации учебного процесса. Её идеи о сочетании классического образования с современными методами преподавания стали основой для многих программ академии.
            </p>
            <h3 className="section-title">Учебные программы и инновации</h3>
            <p className="text2">
            Академия предлагала разнообразные учебные программы, включая исламское богословие, арабский язык, историю ислама, а также курсы по естественным и социальным наукам. Программа исламского богословия была основана на глубоких текстах, таких как Корана и хадисов, и включала дискуссии о применении этих учений в современном мире.
            </p>
            <p className="text3">
            Студенты имели возможность участвовать в исследовательских проектах и стажировках, что способствовало их профессиональному росту. Одной из самых успешных инициатив стала программа «Исламская этика в бизнесе», где студенты изучали, как исламские принципы могут применяться в экономике и предпринимательстве.            </p>
            <h3 className="section-title">Будущее</h3>
            <p className="text4">
            С каждым годом «Свет знания» продолжала развиваться. В 2023 году была запущена новая программа, посвященная исламской этике в контексте современных технологий, что привлекло студентов, интересующихся вопросами, связанными с искусственным интеллектом и цифровой этикой. Академия также открыла исследовательский центр, фокусирующийся на роли ислама в глобальных вопросах, таких как изменение климата и социальная справедливость.
            </p>
            <p className="text5">
            Таким образом, Исламская академия «Свет знания» стала не только образовательным учреждением, но и символом надежды и прогресса для всего региона. Она объединяла студентов из разных культур и традиций, способствуя диалогу и взаимопониманию. Вдохновленные своими наставниками, студенты академии становились лидерами, готовыми к вызовам современного мира и открытыми к новым знаниям.
            </p>
          </div>
        </div>
      );
};

