import Naws from '../../../shared/images/homeImages/news.jpg'
import './news.scss'
import F1 from '../../../shared/images/homeImages/flower.png'

export const News = () => {

  const newsData = [
    {
      title: 'День открытых дверей',
      desc: 'На этой неделе наша академия имела честь    принять выдающихся ученых из разных  уголков  исламского мира. В рамках серии лекций и  дискуссий они поделились своими знаниями о  важности исламского образования в современном обществе. ',
      date: '22.06.2023',
    },

    {
      title: 'День открытых дверей',
      desc: 'На этой неделе наша академия имела честь    принять выдающихся ученых из разных  уголков  исламского мира. В рамках серии лекций и  дискуссий они поделились своими знаниями о  важности исламского образования в современном обществе. ',
      date: '22.06.2023',
    },

    {
      title: 'День открытых дверей',
      desc: 'На этой неделе наша академия имела честь    принять выдающихся ученых из разных  уголков  исламского мира. В рамках серии лекций и  дискуссий они поделились своими знаниями о  важности исламского образования в современном обществе. ',
      date: '22.06.2023',
    },

    {
      title: 'День открытых дверей',
      desc: 'На этой неделе наша академия имела честь    принять выдающихся ученых из разных  уголков  исламского мира. В рамках серии лекций и  дискуссий они поделились своими знаниями о  важности исламского образования в современном обществе. ',
      date: '22.06.2023',
    },

    {
      title: 'День открытых дверей',
      desc: 'На этой неделе наша академия имела честь    принять выдающихся ученых из разных  уголков  исламского мира. В рамках серии лекций и  дискуссий они поделились своими знаниями о  важности исламского образования в современном обществе. ',
      date: '22.06.2023',
    },

    {
      title: 'День открытых дверей',
      desc: 'На этой неделе наша академия имела честь    принять выдающихся ученых из разных  уголков  исламского мира. В рамках серии лекций и  дискуссий они поделились своими знаниями о  важности исламского образования в современном обществе. ',
      date: '22.06.2023',
    },

    {
      title: 'День открытых дверей',
      desc: 'На этой неделе наша академия имела честь    принять выдающихся ученых из разных  уголков  исламского мира. В рамках серии лекций и  дискуссий они поделились своими знаниями о  важности исламского образования в современном обществе. ',
      date: '22.06.2023',
    },

    {
      title: 'День открытых дверей',
      desc: 'На этой неделе наша академия имела честь    принять выдающихся ученых из разных  уголков  исламского мира. В рамках серии лекций и  дискуссий они поделились своими знаниями о  важности исламского образования в современном обществе. ',
      date: '22.06.2023',
    }
  ]

  return (
    <div className="container">
      <section className="news">
        <div className="text-news-head">
          <h2 className="op" id='title-head'>НОВОСТИ</h2>
          <p className='view-all'>читать больше  →</p>
        </div>


        <div className="news-grid">

          {newsData.map((item, index) => (
            <div key={index} className="news-card">
              <img src={Naws} className="news-image" />
              <div className="card-flex">
                <p className="date" style={{marginTop: '10px'}}>{item.date}</p>
                <h3 id="title-card" style={{marginTop: '5px'}}>{item.title}</h3>
              </div>
              <p style={{marginTop: '5px'}} className='card-desc'>{item.desc}</p>
              <div className="flex-i">
              <p style={{ cursor: 'pointer', textAlign: 'start', marginTop: '30px', color: 'rgba(26, 66, 119, 1)'}} className='view-all'>читать больше ↗</p> 
              <img src={F1} className="flower"/>
              </div>
            </div>
          ))}

        </div>


      </section>
    </div>
  )
}
