import React from "react";
import './scientific.scss';

import { Link } from "react-router-dom";


export const Scientific = () => {

    const InvestigationPublic = [
        {
            id: 1,
            title: "Динамическое поведение рационального разностного уравнения",
            description:
                "Системы с дискретным временем иногда используются для объяснения природных явлений, встречающихся в нелинейных науках. Мы изучаем периодичность, ограниченность, колебания, устойчивость и некоторые точные решения нелинейных разностных уравнений. Точные решения получены с помощью стандартного итерационного метода. Для проверки устойчивости точек равновесия используются некоторые известные теоремы. Также приведены некоторые численные примеры для подтверждения достоверности теоретических результатов. Численная составляющая реализована с помощью Wolfram Mathematica. Представленный метод можно легко применить к некоторым другим рациональным рекурсивным задачам. ",
            link: "#",
        },
        {
            id: 2,
            title: "Динамическое поведение рационального разностного уравнения",
            description:
                "Системы с дискретным временем иногда используются для объяснения природных явлений, встречающихся в нелинейных науках. Мы изучаем периодичность, ограниченность, колебания, устойчивость и некоторые точные решения нелинейных разностных уравнений. Точные решения получены с помощью стандартного итерационного метода. Для проверки устойчивости точек равновесия используются некоторые известные теоремы. Также приведены некоторые численные примеры для подтверждения достоверности теоретических результатов. Численная составляющая реализована с помощью Wolfram Mathematica. Представленный метод можно легко применить к некоторым другим рациональным рекурсивным задачам. ",
            link: "#",
        },
        {
            id: 3,
            title: "Динамическое поведение рационального разностного уравнения",
            description:
                "Системы с дискретным временем иногда используются для объяснения природных явлений, встречающихся в нелинейных науках. Мы изучаем периодичность, ограниченность, колебания, устойчивость и некоторые точные решения нелинейных разностных уравнений. Точные решения получены с помощью стандартного итерационного метода. Для проверки устойчивости точек равновесия используются некоторые известные теоремы. Также приведены некоторые численные примеры для подтверждения достоверности теоретических результатов. Численная составляющая реализована с помощью Wolfram Mathematica. Представленный метод можно легко применить к некоторым другим рациональным рекурсивным задачам. ",
            link: "#",
        },
        {
            id: 4,
            title: "Динамическое поведение рационального разностного уравнения",
            description:
                "Системы с дискретным временем иногда используются для объяснения природных явлений, встречающихся в нелинейных науках. Мы изучаем периодичность, ограниченность, колебания, устойчивость и некоторые точные решения нелинейных разностных уравнений. Точные решения получены с помощью стандартного итерационного метода. Для проверки устойчивости точек равновесия используются некоторые известные теоремы. Также приведены некоторые численные примеры для подтверждения достоверности теоретических результатов. Численная составляющая реализована с помощью Wolfram Mathematica. Представленный метод можно легко применить к некоторым другим рациональным рекурсивным задачам. ",
            link: "#",
        },
    ]
    return (
        <div className="publicatinon">


            <div className="container">
                <h1 className="title">Путь к новым открытиям.</h1>
                <p className="description">Научные исследования в нашей Академии — это основа для развития новых идей и инновационных решений. Мы стремимся к углубленному изучению различных дисциплин, проводя исследования, которые способствуют научному прогрессу и решению актуальных задач общества. Наши исследования охватывают широкий спектр областей, от фундаментальных наук до прикладных направлений.</p>
                <h1 className="container__title">Научные журналы</h1>
                <div className="sim-icon">

                </div>
                <div className="container__list">
                    {InvestigationPublic.map((pub) => (
                        <div
                            key={pub.id}

                        >
                            <div className="publication-card">
                                <div className="publication-card__logo">
                                    <span>ИССЛАМСКАЯ</span>
                                    <span>АКАДЕМИЯ</span>
                                </div>
                                <div className="publication-card__content">
                                    <h2 className="publication-card__title">{pub.title}</h2>
                                    <p className="publication-card__description">{pub.description}</p>
                                    <a className="publication-card__Link" to={'/'}>Прочитать еще...</a>
                                </div>
                            </div>
                        </div>
                    ))}


                </div>
            </div>
        </div>


    );
}
export default Scientific;
