import "./homeNews.scss"
import Naws from '../../../shared/images/news.jpg'
import flower from '../../../shared/images/flower.png'

const newsData = [
    {
        title: 'День открытых дверей',
        desc: 'На этой неделе наша академия имела честь    принять выдающихся ученых из разных  уголков  исламского мира. В рамках серии лекций и  дискуссий они поделились своими знаниями о  важности исламского образования в современном обществе. ',
        date: '22.06.2023',
    },

    {
        title: 'День открытых дверей',
        desc: 'На этой неделе наша академия имела честь    принять выдающихся ученых из разных  уголков  исламского мира. В рамках серии лекций и  дискуссий они поделились своими знаниями о  важности исламского образования в современном обществе. ',
        date: '22.06.2023',
    },

    {
        title: 'День открытых дверей',
        desc: 'На этой неделе наша академия имела честь    принять выдающихся ученых из разных  уголков  исламского мира. В рамках серии лекций и  дискуссий они поделились своими знаниями о  важности исламского образования в современном обществе. ',
        date: '22.06.2023',
    },

    {
        title: 'День открытых дверей',
        desc: 'На этой неделе наша академия имела честь    принять выдающихся ученых из разных  уголков  исламского мира. В рамках серии лекций и  дискуссий они поделились своими знаниями о  важности исламского образования в современном обществе. ',
        date: '22.06.2023',
    },

    {
        title: 'День открытых дверей',
        desc: 'На этой неделе наша академия имела честь    принять выдающихся ученых из разных  уголков  исламского мира. В рамках серии лекций и  дискуссий они поделились своими знаниями о  важности исламского образования в современном обществе. ',
        date: '22.06.2023',
    },

    {
        title: 'День открытых дверей',
        desc: 'На этой неделе наша академия имела честь    принять выдающихся ученых из разных  уголков  исламского мира. В рамках серии лекций и  дискуссий они поделились своими знаниями о  важности исламского образования в современном обществе. ',
        date: '22.06.2023',
    },

    {
        title: 'День открытых дверей',
        desc: 'На этой неделе наша академия имела честь    принять выдающихся ученых из разных  уголков  исламского мира. В рамках серии лекций и  дискуссий они поделились своими знаниями о  важности исламского образования в современном обществе. ',
        date: '22.06.2023',
    },

    {
        title: 'День открытых дверей',
        desc: 'На этой неделе наша академия имела честь    принять выдающихся ученых из разных  уголков  исламского мира. В рамках серии лекций и  дискуссий они поделились своими знаниями о  важности исламского образования в современном обществе. ',
        date: '22.06.2023',
    }
]
export const HomeNews = () => {
    return (
        <div className="container">
            <section className="homeNews">
                <div className="homeNews_head">
                    <h2 className="homeNews_head_title">НОВОСТИ</h2>
                    <p className='homeNews_head_all'>читать больше  →</p>
                </div>


                <div className="homeNews_group">

                    {newsData.map((item, index) => (
                        <div key={index} className="homeNews_group_card">
                            <img src={Naws} className="homeNews_group_card_image" />
                            <div className="card-flex">
                                <p className="homeNews_group_card_date" style={{ marginTop: '10px' }}>{item.date}</p>
                                <h3 className="homeNews_group_card_title" style={{ marginTop: '5px' }}>{item.title}</h3>
                            </div>
                            <p style={{ marginTop: '5px' }} className='card-desc'>{item.desc}</p>
                            <div className="flex-i">
                                <p style={{ cursor: 'pointer', textAlign: 'start', marginTop: '30px', color: 'rgba(26, 66, 119, 1)' }} className='view-all'>читать больше  →</p>
                                <img src={flower} className="flower"/>
                            </div>
                        </div>
                    ))}

                </div>


            </section>
        </div>
    )
}
